# -*- coding: utf-8 -*-

"""
@author: Jie Yin
@e-mail: mumingv@163.com
@date:   2016-03-19
""" 

# 时间函数
# https://docs.python.org/2.7/library/time.html

# +---------------------------+--------------------------------------------+
#   时间函数                    含义
# +---------------------------+--------------------------------------------+
#   time.clock()                返回处理器时间，单位：秒
# +---------------------------+--------------------------------------------+

# 示例
import time

# 处理器时间是指从程序开始运行经过的时间
j = 0
for i in range(0, 10000000):
    j = j + 1
print "clock:", time.clock()  #第一次调用，返回处理器时间, 输出：1.93
j = 0
for i in range(0, 10000000):
    j = j + 1
print "clock:", time.clock()  #第二次调用，返回处理器时间, 输出：3.74

