# -*- coding: utf-8 -*-

"""
@author: Jie Yin
@e-mail: mumingv@163.com
@date:   2016-03-16
""" 

"""
注释
"""
# 单行注释：使用#(井号)
# 多行注释：使用一对'''(三个单引号)，或者使用一对"""(三个双引号)包含注释信息


"""
缩进
"""
# 使用缩进表示代码块，不用{}表示代码块


"""
变量
"""
# 命名
## 1. 由字母、数字、下划线组成，且不能以数字开头；
## 2. 中文字符也可以作为变量名称；

# 保留字(共33个), 不能用作变量的名字
## 8个: and as assert break class continue def del
## 8个: elif else except finally for from globall if
## 8个: import in is lambda nonlocal not or pass
## 6个: raise return try while with yield
## 3个: True False None

# 同步赋值
## 含义：指同时给多个变量赋值，即先运算右侧N个表达式，然后同时将表达式结果赋值给左侧对应的变量。
## 语法：<变量1>, <变量2>, ... , <变量N> = <表达式1>, <表达式2>, ... , <表达式N>
## 示例：交换变量x和y的值
print "同步赋值"
x = 2
y = 3
print "交换前: x =", x, ", y =", y
x, y = y, x
print "交换后: x =", x, ", y =", y

"""
数据结构 - List
"""

"""
数据结构 - Tuple
"""

"""
数据结构 - Dict
"""

"""
数据结构 - Set
"""

"""
数据结构 - 总结
"""
# +---------+----------+----------+----------+------------------------+
# +         + 顺序存储 + 内容可变 + 重复元素 +  备注                  +
# +---------+----------+----------+----------+------------------------+
# +  List   +    是    +    是    +    是    +   []                   +
# +---------+----------+----------+----------+------------------------+
# +  Tuple  +    是    +    否    +    是    +   ()                   +
# +---------+----------+----------+----------+------------------------+
# +  Dict   +    否    +    是    +    否    +   {}                   +
# +---------+----------+----------+----------+------------------------+
# +  Set    +    否    +    是    +    否    + set([]), 只有key的Dict +
# +---------+----------+----------+----------+------------------------+

"""
函数
"""

"""
类
"""

"""
条件语句
"""

"""
循环语句
"""

"""
"""

